nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_event.h
#define EVENT_UDMACH14BSEL_EV_GPT2A                                 0x0000000C
#define EVENT_UDMACH14BSEL_EV_AUX_COMB                              0x0000000B
#define EVENT_UDMACH14BSEL_EV_AON_AUX_SWEV0                         0x0000000A
#define EVENT_UDMACH14BSEL_EV_I2C_IRQ                               0x00000009
#define EVENT_UDMACH14BSEL_EV_I2S_IRQ                               0x00000008
#define EVENT_UDMACH14BSEL_EV_AON_RTC_COMB                          0x00000007
#define EVENT_UDMACH14BSEL_EV_OSC_COMB                              0x00000006
#define EVENT_UDMACH14BSEL_EV_BATMON_COMB                           0x00000005
#define EVENT_UDMACH14BSEL_EV_AON_GPIO_EDGE                         0x00000004
#define EVENT_UDMACH14BSEL_EV_AON_PROG2                             0x00000003
#define EVENT_UDMACH14BSEL_EV_AON_PROG1                             0x00000002
#define EVENT_UDMACH14BSEL_EV_AON_PROG0                             0x00000001
#define EVENT_UDMACH14BSEL_EV_NONE                                  0x00000000

//*****************************************************************************
//
// Register: EVENT_O_UDMACH15BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AON_RTC_COMB             Event from AON_RTC, controlled by the
//                          AON_RTC:CTL.COMB_EV_MASK setting
#define EVENT_UDMACH15BSEL_EV_W                                              7
#define EVENT_UDMACH15BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH15BSEL_EV_S                                              0
#define EVENT_UDMACH15BSEL_EV_AON_RTC_COMB                          0x00000007

//*****************************************************************************
//
// Register: EVENT_O_UDMACH16SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_RX_DMASREQ          SSI1 RX DMA single request, controlled by
//                          SSI0:DMACR.RXDMAE
#define EVENT_UDMACH16SSEL_EV_W                                              7
#define EVENT_UDMACH16SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH16SSEL_EV_S                                              0
#define EVENT_UDMACH16SSEL_EV_SSI1_RX_DMASREQ                       0x0000002D

//*****************************************************************************
//
// Register: EVENT_O_UDMACH16BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_RX_DMABREQ          SSI1 RX DMA burst request , controlled by
//                          SSI0:DMACR.RXDMAE
#define EVENT_UDMACH16BSEL_EV_W                                              7
#define EVENT_UDMACH16BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH16BSEL_EV_S                                              0
#define EVENT_UDMACH16BSEL_EV_SSI1_RX_DMABREQ                       0x0000002C

//*****************************************************************************
//
// Register: EVENT_O_UDMACH17SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_TX_DMASREQ          SSI1 TX DMA single request, controlled by
//                          SSI0:DMACR.TXDMAE
#define EVENT_UDMACH17SSEL_EV_W                                              7
#define EVENT_UDMACH17SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH17SSEL_EV_S                                              0
#define EVENT_UDMACH17SSEL_EV_SSI1_TX_DMASREQ                       0x0000002F

//*****************************************************************************
//
// Register: EVENT_O_UDMACH17BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_TX_DMABREQ          SSI1 TX DMA burst request , controlled by
//                          SSI0:DMACR.TXDMAE
#define EVENT_UDMACH17BSEL_EV_W                                              7
#define EVENT_UDMACH17BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH17BSEL_EV_S                                              0
#define EVENT_UDMACH17BSEL_EV_SSI1_TX_DMABREQ                       0x0000002E

//*****************************************************************************
//
// Register: EVENT_O_UDMACH21SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV0                    Software event 0, triggered by SWEV.SWEV0
#define EVENT_UDMACH21SSEL_EV_W                                              7
#define EVENT_UDMACH21SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH21SSEL_EV_S                                              0
#define EVENT_UDMACH21SSEL_EV_SWEV0                                 0x00000064

//*****************************************************************************
//
// Register: EVENT_O_UDMACH21BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV0                    Software event 0, triggered by SWEV.SWEV0
#define EVENT_UDMACH21BSEL_EV_W                                              7
#define EVENT_UDMACH21BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH21BSEL_EV_S                                              0
#define EVENT_UDMACH21BSEL_EV_SWEV0                                 0x00000064

//*****************************************************************************
//
// Register: EVENT_O_UDMACH22SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV1                    Software event 1, triggered by SWEV.SWEV1
#define EVENT_UDMACH22SSEL_EV_W                                              7
#define EVENT_UDMACH22SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH22SSEL_EV_S                                              0
#define EVENT_UDMACH22SSEL_EV_SWEV1                                 0x00000065

//*****************************************************************************
//
// Register: EVENT_O_UDMACH22BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV1                    Software event 1, triggered by SWEV.SWEV1
#define EVENT_UDMACH22BSEL_EV_W                                              7
#define EVENT_UDMACH22BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH22BSEL_EV_S                                              0
#define EVENT_UDMACH22BSEL_EV_SWEV1                                 0x00000065

//*****************************************************************************
//
// Register: EVENT_O_UDMACH23SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV2                    Software event 2, triggered by SWEV.SWEV2
#define EVENT_UDMACH23SSEL_EV_W                                              7
#define EVENT_UDMACH23SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH23SSEL_EV_S                                              0
#define EVENT_UDMACH23SSEL_EV_SWEV2                                 0x00000066

//*****************************************************************************
//
// Register: EVENT_O_UDMACH23BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV2                    Software event 2, triggered by SWEV.SWEV2
#define EVENT_UDMACH23BSEL_EV_W                                              7
#define EVENT_UDMACH23BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH23BSEL_EV_S                                              0
#define EVENT_UDMACH23BSEL_EV_SWEV2                                 0x00000066

//*****************************************************************************
//
// Register: EVENT_O_UDMACH24SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV3                    Software event 3, triggered by SWEV.SWEV3
#define EVENT_UDMACH24SSEL_EV_W                                              7
#define EVENT_UDMACH24SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH24SSEL_EV_S                                              0
#define EVENT_UDMACH24SSEL_EV_SWEV3                                 0x00000067

//*****************************************************************************
//
// Register: EVENT_O_UDMACH24BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV3                    Software event 3, triggered by SWEV.SWEV3
#define EVENT_UDMACH24BSEL_EV_W                                              7
#define EVENT_UDMACH24BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH24BSEL_EV_S                                              0
#define EVENT_UDMACH24BSEL_EV_SWEV3                                 0x00000067

//*****************************************************************************
//
// Register: EVENT_O_GPT3ACAPTSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read/write selection value
//
// Writing any other value than values defined by a ENUM may result in
// undefined behavior.
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// AON_RTC_UPD              RTC periodic event controlled by
//                          AON_RTC:CTL.RTC_UPD_EN
// AUX_ADC_IRQ              AUX ADC interrupt event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_IRQ. Status
//                          flags are found here AUX_EVCTL:EVTOMCUFLAGS
// AUX_OBSMUX0              Loopback of OBSMUX0 through AUX, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.MCU_OBSMUX0
// AUX_ADC_FIFO_ALMOST_FULL AUX ADC FIFO watermark event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_FIFO_ALMOST_FULL
// AUX_ADC_DONE             AUX ADC done, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_DONE
// AUX_SMPH_AUTOTAKE_DONE   Autotake event from AUX semaphore, configured by
//                          AUX_SMPH:AUTOTAKE
// AUX_TIMER1_EV            AUX timer 1 event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER1_EV
// AUX_TIMER0_EV            AUX timer 0 event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER0_EV
// AUX_TDC_DONE             AUX TDC measurement done event, corresponds to the
//                          flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TDC_DONE and
//                          the AUX_TDC status AUX_TDC:STAT.DONE
// AUX_COMPB                AUX Compare B event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB
// AUX_COMPA                AUX Compare A event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA
// AUX_AON_WU_EV            AON wakeup event, the corresponding flag is here
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_WU_EV
// PORT_EVENT7              Port capture event from IOC, configured by
//                          IOC:IOCFGn.PORT_ID. Events on ports configured
//                          with ENUM PORT_EVENT7 wil be routed here.
// PORT_EVENT6              Port capture event from IOC, configured by
//                          IOC:IOCFGn.PORT_ID. Events on ports configured
//                          with ENUM PORT_EVENT6 wil be routed here.
// GPT3B_CMP                GPT3B compare event. Configured by GPT3:TBMR.TCACT
// GPT3A_CMP                GPT3A compare event. Configured by GPT3:TAMR.TCACT
// GPT2B_CMP                GPT2B compare event. Configured by GPT2:TBMR.TCACT
// GPT2A_CMP                GPT2A compare event. Configured by GPT2:TAMR.TCACT
// GPT1B_CMP                GPT1B compare event. Configured by GPT1:TBMR.TCACT
// GPT1A_CMP                GPT1A compare event. Configured by GPT1:TAMR.TCACT
// GPT0B_CMP                GPT0B compare event. Configured by GPT0:TBMR.TCACT
// GPT0A_CMP                GPT0A compare event. Configured by GPT0:TAMR.TCACT
// AUX_TIMER2_PULSE         AUX Timer2 pulse, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_PULSE
// AUX_TIMER2_EV3           AUX Timer2 event 3, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV3
// AUX_TIMER2_EV2           AUX Timer2 event 2, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV2
// AUX_TIMER2_EV1           AUX Timer2 event 1, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV1
// AUX_TIMER2_EV0           AUX Timer2 event 0, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV0
// UART1_COMB               UART1 combined interrupt, interrupt flags are
//                          found here UART1:MIS
// UART0_COMB               UART0 combined interrupt, interrupt flags are
//                          found here UART0:MIS
// SSI1_COMB                SSI1 combined interrupt, interrupt flags are found
//                          here SSI1:MIS
// SSI0_COMB                SSI0 combined interrupt, interrupt flags are found
//                          here SSI0:MIS
// RFC_CPE_1                Combined Interrupt for CPE Generated events.
//                          Corresponding flags are here
//                          RFC_DBELL:RFCPEIFG. Only interrupts selected
//                          with CPE1 in RFC_DBELL:RFCPEIFG can trigger a
//                          RFC_CPE_1 event
// RFC_CPE_0                Combined Interrupt for CPE Generated events.
//                          Corresponding flags are here
//                          RFC_DBELL:RFCPEIFG. Only interrupts selected
//                          with CPE0 in RFC_DBELL:RFCPEIFG can trigger a
//                          RFC_CPE_0 event
// RFC_HW_COMB              Combined RFC hardware interrupt, corresponding
//                          flag is here RFC_DBELL:RFHWIFG
// RFC_CMD_ACK              RFC Doorbell Command Acknowledgement Interrupt,
//                          equvialent to RFC_DBELL:RFACKIFG.ACKFLAG
// FLASH                    FLASH controller error event,  the status flags
//                          are FLASH:FEDACSTAT.FSM_DONE and
//                          FLASH:FEDACSTAT.RVF_INT
// AUX_COMB                 AUX combined event, the corresponding flag
//                          register is here AUX_EVCTL:EVTOMCUFLAGS
// I2C_IRQ                  Interrupt event from I2C
// AON_RTC_COMB             Event from AON_RTC, controlled by the
//                          AON_RTC:CTL.COMB_EV_MASK setting
// OSC_COMB                 Combined event from Oscillator control
// BATMON_COMB              Combined event from battery monitor
// AON_GPIO_EDGE            Edge detect event from IOC. Configureded by the
//                          IOC:IOCFGn.EDGE_IRQ_EN and  IOC:IOCFGn.EDGE_DET
//                          settings
// NONE                     Always inactive
#define EVENT_GPT3ACAPTSEL_EV_W                                              7
#define EVENT_GPT3ACAPTSEL_EV_M                                     0x0000007F
#define EVENT_GPT3ACAPTSEL_EV_S                                              0
#define EVENT_GPT3ACAPTSEL_EV_ALWAYS_ACTIVE                         0x00000079
#define EVENT_GPT3ACAPTSEL_EV_AON_RTC_UPD                           0x00000077
#define EVENT_GPT3ACAPTSEL_EV_AUX_ADC_IRQ                           0x00000073
#define EVENT_GPT3ACAPTSEL_EV_AUX_OBSMUX0                           0x00000072
#define EVENT_GPT3ACAPTSEL_EV_AUX_ADC_FIFO_ALMOST_FULL              0x00000071
#define EVENT_GPT3ACAPTSEL_EV_AUX_ADC_DONE                          0x00000070
#define EVENT_GPT3ACAPTSEL_EV_AUX_SMPH_AUTOTAKE_DONE                0x0000006F
#define EVENT_GPT3ACAPTSEL_EV_AUX_TIMER1_EV                         0x0000006E
#define EVENT_GPT3ACAPTSEL_EV_AUX_TIMER0_EV                         0x0000006D
#define EVENT_GPT3ACAPTSEL_EV_AUX_TDC_DONE                          0x0000006C
#define EVENT_GPT3ACAPTSEL_EV_AUX_COMPB                             0x0000006B
#define EVENT_GPT3ACAPTSEL_EV_AUX_COMPA                             0x0000006A
#define EVENT_GPT3ACAPTSEL_EV_AUX_AON_WU_EV                         0x00000069
#define EVENT_GPT3ACAPTSEL_EV_PORT_EVENT7                           0x0000005C
#define EVENT_GPT3ACAPTSEL_EV_PORT_EVENT6                           0x0000005B
#define EVENT_GPT3ACAPTSEL_EV_GPT3B_CMP                             0x00000044
#define EVENT_GPT3ACAPTSEL_EV_GPT3A_CMP                             0x00000043
#define EVENT_GPT3ACAPTSEL_EV_GPT2B_CMP                             0x00000042
#define EVENT_GPT3ACAPTSEL_EV_GPT2A_CMP                             0x00000041
#define EVENT_GPT3ACAPTSEL_EV_GPT1B_CMP                             0x00000040
#define EVENT_GPT3ACAPTSEL_EV_GPT1A_CMP                             0x0000003F
#define EVENT_GPT3ACAPTSEL_EV_GPT0B_CMP                             0x0000003E
#define EVENT_GPT3ACAPTSEL_EV_GPT0A_CMP                             0x0000003D
#define EVENT_GPT3ACAPTSEL_EV_AUX_TIMER2_PULSE                      0x0000003C
#define EVENT_GPT3ACAPTSEL_EV_AUX_TIMER2_EV3                        0x0000003B
#define EVENT_GPT3ACAPTSEL_EV_AUX_TIMER2_EV2                        0x0000003A
#define EVENT_GPT3ACAPTSEL_EV_AUX_TIMER2_EV1                        0x00000039
#define EVENT_GPT3ACAPTSEL_EV_AUX_TIMER2_EV0                        0x00000038
#define EVENT_GPT3ACAPTSEL_EV_UART1_COMB                            0x00000025
#define EVENT_GPT3ACAPTSEL_EV_UART0_COMB                            0x00000024
#define EVENT_GPT3ACAPTSEL_EV_SSI1_COMB                             0x00000023
#define EVENT_GPT3ACAPTSEL_EV_SSI0_COMB                             0x00000022
#define EVENT_GPT3ACAPTSEL_EV_RFC_CPE_1                             0x0000001E
#define EVENT_GPT3ACAPTSEL_EV_RFC_CPE_0                             0x0000001B
#define EVENT_GPT3ACAPTSEL_EV_RFC_HW_COMB                           0x0000001A
#define EVENT_GPT3ACAPTSEL_EV_RFC_CMD_ACK                           0x00000019
#define EVENT_GPT3ACAPTSEL_EV_FLASH                                 0x00000015
#define EVENT_GPT3ACAPTSEL_EV_AUX_COMB                              0x0000000B
#define EVENT_GPT3ACAPTSEL_EV_I2C_IRQ                               0x00000009
#define EVENT_GPT3ACAPTSEL_EV_AON_RTC_COMB                          0x00000007
#define EVENT_GPT3ACAPTSEL_EV_OSC_COMB                              0x00000006
#define EVENT_GPT3ACAPTSEL_EV_BATMON_COMB                           0x00000005
#define EVENT_GPT3ACAPTSEL_EV_AON_GPIO_EDGE                         0x00000004
#define EVENT_GPT3ACAPTSEL_EV_NONE                                  0x00000000

